# GradingInSamePhase Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SiteFailures..::..GradingInSamePhase Property
BuiltInFailures..::..SiteFailures Class See Also
---
The Surface being Graded was created in the current Phase. Grading it will result in it being created and destroyed in the same Phase.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId GradingInSamePhase { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GradingInSamePhase As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ GradingInSamePhase {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SiteFailures Class
Autodesk.Revit.DB Namespace